# 2. How do I select a pandas Series from a DataFrame?

In [1]:
import pandas as pd
ufo = pd.read_csv("data/uforeports.csv", index_col=0)
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca , NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro , NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke , CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene , KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair , NY"

In [2]:
# 'type()': Python built-in functions that Shows the type of the variable passed 
type(ufo)

pandas.core.frame.DataFrame

In [3]:
type(ufo['City'])

pandas.core.series.Series

In [5]:
# 'shape': Return the dimensions of the DataFrame (rows, columns).
ufo.shape

(18241, 6)

In [6]:
# We can select pandas Series by accessing directly the column, eg: ufo['City']
# another way is to access the column as property, but in this case the name of the column
# must obey to the conditions of variables naming(no spacing, begins with letter, ...).
ufo.City.head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

In [7]:
# BONUS:
# create a new 'Location' Series (must use bracket notation to define the Series name)

ufo['Location'] = ufo['City'] + ' , ' + ufo['State']
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca , NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro , NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke , CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene , KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair , NY"